{
  "id": "a_novel_negative_transfer_resistant_fuzzy_clustering_model_with_a_shared_cross_domain_transfer_laten",
  "title": "A Novel Negative-Transfer-Resistant Fuzzy Clustering Model With a Shared Cross-Domain Transfer Latent Space and its Application to Brain CT Image Segmentation",
  "authors": [
    "YizhangJiang",
    "XiaoqingGu",
    "DongruiWu",
    "WenlongHang",
    "JingXue",
    "ShiQiu",
    "Chin-TengLin",
    "ÇYJiang",
    "C.-TLin",
    "School of Digital Media\n\t\t\t\t\t\t\t\tJiangsu Key Laboratory of Media Design and Software Technology\n\t\t\t\t\t\t\t\tJiangnan University\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t214122\n\t\t\t\t\t\t\t\t\tWuxi\n\t\t\t\t\t\t\t\t\tJiangsu\n\t\t\t\t\t\t\t\t\tChina",
    "School of Information Science and Engineering\n\t\t\t\t\t\t\t\tJiangnan University\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t214122\n\t\t\t\t\t\t\t\t\tWuxi\n\t\t\t\t\t\t\t\t\tJiangsu\n\t\t\t\t\t\t\t\t\tChina",
    "School of Automation\n\t\t\t\t\t\t\t\tLaboratory of the Ministry of Education for Image Processing and Intelligent Control\n\t\t\t\t\t\t\t\tChangzhou University\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t213164\n\t\t\t\t\t\t\t\t\tChangzhou\n\t\t\t\t\t\t\t\t\tJiangsu\n\t\t\t\t\t\t\t\t\tChina",
    "School of Computer Science and Technology\n\t\t\t\t\t\t\t\tHuazhong University of Science and Technology\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t430074\n\t\t\t\t\t\t\t\t\tWuhan\n\t\t\t\t\t\t\t\t\tHubei\n\t\t\t\t\t\t\t\t\tChina",
    "Department of Nephrology\n\t\t\t\t\t\t\t\tNanjing Tech University\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t211816\n\t\t\t\t\t\t\t\t\tNanjing\n\t\t\t\t\t\t\t\t\tJiangsu\n\t\t\t\t\t\t\t\t\tChina",
    "Xi'an Institute of Optics and Precision Mechanics\n\t\t\t\t\t\t\t\tLaboratory of Spectral Imaging Technology CAS\n\t\t\t\t\t\t\t\tthe Affiliated Wuxi People's Hospital of Nanjing Medical University\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t214023\n\t\t\t\t\t\t\t\t\tWuxi\n\t\t\t\t\t\t\t\t\tJiangsu\n\t\t\t\t\t\t\t\t\tChina",
    "Faculty of Engineer- ing and Information Technology\n\t\t\t\t\t\t\t\tCentre of Artificial Intelligence\n\t\t\t\t\t\t\t\tChinese Academy of Sciences\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tXi'an\n\t\t\t\t\t\t\t\t\t710119\n\t\t\t\t\t\t\t\t\tShaanxi\n\t\t\t\t\t\t\t\t\tChina",
    "University of Technology Sydney\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t2007\n\t\t\t\t\t\t\t\t\tUltimo\n\t\t\t\t\t\t\t\t\tNSW\n\t\t\t\t\t\t\t\t\tAustralia"
  ],
  "content": "W ITH the development of electronic information and computer technology, medical imaging and image processing technology have developed rapidly. Medical imaging equipments collect images for a short time, and are less affected by external factors. Today, medical imaging technology has become a powerful tool and core technology for modern clinical diagnosis and treatment. Commonly used medical imaging techniques include Magnetic Resonance Imaging (MRI), Computed Tomography (CT), Computed Radiography (CR), Ultrasound, and so on. CT scans produce clearer images than conventional x-ray for internal organs, bone and soft tissues. MRI scans furnish greater clearness and higher resolution than CT scans with lower resolution [1]. Medical image segmentation is a basic and important step in medical image processing and analysis. It is also the basis of medical image registration, medical image information fusion and 3D visualization. In the current clinical practice, manual segmentation based on visual recognition and empirical judgment by doctors is still the most typical and common segmentation method. However, manual segmentation is tedious, time consuming and subjective. For example, in the Isointense Infant Brain Segmentation Challenge (ISEG2017), manual segmentation of each brain MRI scan took an average of one week for neuroradiologists [2]. Furthermore, the differences in physician experience and uncertain factors such as visual fatigue will affect the correct analysis of segmentation results. With the rapid growth of the image processing technology, many automatic image processing techniques have appeared in recent years [3], [4], [5]. Image segmentation methods can be broadly classified into four categories: graph based methods, classification methods, deep learning methods and clustering methods [6]. A medical image in graph based image segmentation is presented as a weighted undirected graph [7]. Each pixel or region in the image is treated as a vertex of a graph, and the set of edges can be connected by adjacent pixels or two adjacent regions. Then the image is divided into several parts according to the relationship of the adjacent pixels. The second category, also called supervised methods, use labeled segmented images to extract features and train a segmentation model, such as k-nearest neighbor (KNN) [8], neural network [9], support vector machine (SVM) [10], and so on. A major drawback of classification methods is that they require sufficient labeled training images. But in the areas of medical imaging, it is relatively easy and inexpensive to obtain a large amount of unlabeled data [11]. Deep learning learns the feature representation of tissue contour based on deep convolutional neural networks [12], [13]. Deep learning methods have successfully applied for medical image segmentation in recent years. However, deep learning methods usually need a large number of training dataset and special hardware devices. It is known that the medical image segmentation problem can be considered as classifying the pixels of images into homogeneous regions. This process can be viewed as clustering problem. Clustering method, as an unsupervised machine learning approach, is the process of grouping a set of data points into subsets so that data points in the same subset are similar (according to some criteria). Widely used clustering methods include expectation-maximization, spectral clustering and fuzzy clustering, and so on. In the last decade, clustering-based methods have attracted great interest in the segmentation of medical images [14]. Portela et al. [15] proposed clustering based semi-supervised classification for brain image segmentation, which used K-means clustering as initial processing to select brain slices. Ortiz et al. [16] improved brain image segmentation by using self-organizing maps (SOMs) based voxel clustering to extract features, and then used entropygradient clustering to segment brain images. Based on the idea of multiobjective optimization, Saha et al. [17] proposed semi-supervised clustering in the intensity space for medical image segmentation. Abdel-Maksouda et al. [18] combined K means and FCM clustering to propose a hybrid clustering method for tumour segmentation from brain image. To make cluster-based segmentation methods perform better, the training medical image data needs to be representative of the target data. However, medical images are often collected with different scanners and scanning parameters, and medical images may have large differences in image quality due to machine performance or scanning technology, such as varying degrees of rotation, noise, etc. The requirement of training and target data under the same distribution prevents the use of clustering methods in larger research and clinical practice. Since the above scenarios exist in a large number of real-world environments, this leads to unsatisfactory segmentation results and the risk of algorithm failure. To solve this problem, researchers have introduced the idea of transfer learning into clustering methods [19], [20]. With the help of some knowledge of auxiliary domain (called source domain), transfer learning handles the cases where the distribution, feature space or tasks are different between source domain and testing domain (called target domain). In transfer learning, the auxiliary knowledge from the source domain involves the data sample, feature representations, parameters and relationships [21], [22], [23]. The knowledge is usually obtained from certain precise procedures and reliable theory through some specific perspectives. Jiang et al. [24] proposed a transfer spectral clustering method, which used both data manifold and feature manifold between related clustering tasks. Deng et al. [25] proposed a transfer prototype-based fuzzy clustering method, which incorporated prototype knowledge induced from source domain to implement the clustering in the target domain. Qian et al. [20] proposed a cross-domain maximum entropy clustering method, which utilized the auxiliary knowledge from cluster centers and fuzzy memberships belonging to source data. However, these methods have a common assumption that source domain and target domain must have the same number of clusters. Moreover, most existing transfer clustering methods are not developed for noisy scenarios. Thus, these methods may be not suitable for noisy medical image segmentation. Since the medical images of different domains may have variations due to changes caused by noise, field offset and bias field, in this paper, we study the problem of medical image segmentation in a noisy scenario by transferring medical images collected from related scenarios. We consider the new noisy scenario as the target domain and the existing medical image dataset from related scenario elsewhere as the source domain, and then use the learning on clean images of source data to improve the clustering in target data. To improve the transfer learning performance, we consider learning the negative-transfer-resistant mechanism, so that the influence of positive transfer knowledge is reinforced and the influence of negative transfer knowledge is reduced or even eliminated. Meanwhile, we think medical images in different scenarios may share certain common representations such as bone and soft tissue, and the shared representations could be preserved in a shared space. Inspired of maximum mean discrepancy (MMD) [26], we learn the shared latent space for source and target domains such that the distributions in different domains are close to each other. We investigate transferring ability of each cluster belonging to source domain in the shared latent space for medical image segmentation modeling. We use the clustering centers in the source domain as the transfer knowledge, regardless of whether the number of clusters in the source domain is the same as that in the target domain. With the above ideas, we propose a negative-transfer-resistant fuzzy clustering model with a shared cross-domain transfer latent space (called NTR-FC-SCT). The motivation of NTR-FC-SCT is shown in Fig. 1. Two cluster centers presented as black triangle and circle have positive transfer influence to the clustering in the target domain, while the cluster center presented as Black Square has negative influence to the clustering in the target domain. NTR-FC-SCT will automatically resist black square participating in the clustering in the target domain by using the negative-transferresistance mechanism. We evaluate the proposed model on real world datasets, and compare with several non-transfer and related transfer clustering methods. The results on real world brain CT dataset demonstrate that NTR-FC-SCT is more robust than the comparison methods. The novelty of this study is as follows. 1) We formulate the problem of insufficient and noisy medical image segmentation as a model of transfer clustering task. To the best of our knowledge, our study is the first attempt to address this issue. 2) The negative-transfer-resistance mechanism is proposed to identify and resist negative source transfer knowledge. 3) The MMD is introduced into NTR-FC-SCT to unify the representation of image data of different domains in the shared transfer latent space, which helps transferring knowledge across different domains. 4) Clustering centers based transfer matching scheme is used to deal with the inconsistency problem of clustering numbers between source and target domains, so that more robust cluster performance can be promoted. The rest of this paper is organized as follows. Concepts related to FCM, transfer learning and MMD are reviewed in Section 2. In Section 3, the negative-transfer-resistant mechanism and new proposed algorithm is introduced. Its parameter learning based on iteratively optimization strategy is then presented accordingly. The experimental results in real-world brain CT image datasets are reported in Section 4. Conclusions are given in the last section. Fuzzy C-means (FCM) clustering [27] is one of most commonly used fuzzy clustering methods. FCM allows data points to belong to more than one cluster defined by a membership matrix. Let X ¼ fx 1 ; x 2 ; . . . ; x N g be a given dataset where d and N are data dimension and capacity, respectively. Suppose C clusters exist in X, FCM derives the following objection function: where U ¼ ½m ij NÂC denotes the fuzzy membership matrix, and V ¼ ½v 1 ; v 2 ; . . . ; v C T denotes the clustering center matrix. m ðm > 1Þ denotes the fuzzy index. FCM finds an optimal group of sets to explain the data samples into C clusters via matrixes Y and U. FCM minimizes the total membership weighted distance of each sample x i to the clustering center v j . FCM can easily optimize the objective functions by an iterative technique. Among center-based clustering methods, FCM was simple, efficient and high popularity. It is widely used in transfer clustering methods. For example, a FCM-based transfer learning was proposed in [28], which combined with Gini-Simpson diversity index and quadratic weights on membership. A knowledge-leveraged transfer FCM (KL-TFCM) was proposed in [29], which used three-interlinked framework of knowledge extraction, knowledge matching, and knowledge utilization to leverage source information to help clustering in the target domain. However, the above FCM-based transfer learning clustering methods are completed in the original space, and while they do not consider resisting negative transfer. Currently, when the training data is not enough to represent the data in the current domain, transfer learning, multi-task learning and co-clustering are three effective techniques that can enhance the clustering performance in the current domain. Multi-task learning performs multiple learning tasks together through by sharing certain knowledge among all tasks [30], [31]. Co-clustering performs clustering on both objects and features to exploit the clear duality between rows and columns of a contingency table [32]. Transfer learning clustering enhances the clustering performance in the target domain by leveraging useful knowledge from different but related domains. Many researches show that the transfer clustering methods have better learning ability to obtain an effective model with the idea of transfer learning [28], [29], [33]. In real applications, due to the existences of noise and field offset etc, the insufficient medical images are inadequate to complete image segmentation. Therefore, we think transfer learning clustering can be used as an effect technology to promote the segmentation of insufficient and noisy medical images in the new domain. In transfer learning, a fundamental problem is to evaluate the distribution difference between source domain and target domain. Many criteria, like Kullback-Leibler (KL) divergence can be used for distribution estimation. But some criteria need density estimation, some are parametric and not suitable for high-dimensional data [34], [35]. In these cases, maximum mean discrepancy (MMD) as a nonparametric estimate criterion receives is widely used for comparing distributions. Let X s ¼ fx 1;s ; x 2;s ; . . . ; x N s ;s g and X t ¼ fX 1;t ; X 2;t ; . . . X N t ;t g denote the samples from distributions P source ðX s Þ and P target ðX t Þ belonging to source and target domains, respectively. The MMD for comparing distributions between P source ðX s Þ and P target ðX t Þ is defined as MMD is based on reproducing kernel Hilbert space (RKHS). Suppose f : X ! H, H is a universal RKHS. By inducing nonlinear mapping f, function evaluation can be represented fðxÞ ¼ < fðxÞ; f > , then equation (2) can be rewritten as When the difference between source and target domains is small, the relationship between two domains is strong and the transfer knowledge can be fully utilized. However, when the data in the source domain is not sufficiently related, the clustering performance in the target domain may not only fail to promote, it may even actually decrease. Thus, transfer learning would resist negative transfer when source and target domains are not a good match. One strategy of resisting negative transfer is to identify and reject unhelpful knowledge from source domain. Some data selection and source selection methods have been proposed. The former implements some rules to select data samples to reconstruct the training set of source domain. For example, Rosenstein et al. [36] proposed a detecting negative transfer algorithm based on naive Bayes classification model. Croonenborghs et al. [37] proposed an option-based transfer in reinforcement learning algorithm to achieve a balance between positive and negative transfer. The source selection methods are applicable for multiple source scenarios, which select the best source domain (task) for transfer learning. An example of this strategy is Talvitie and Singh [38] proposed a Markov decision process to select the proper source task. The schematic diagram of NTR-FC-SCT is shown in Fig. 2. In the noisy transfer learning scenario, compared with data sample, feature representations, parameters and relationships are usually considered as being more insightful and more resistant to noise. In this study, we use the cluster centers in the source domain as auxiliary knowledge. The reason is that cluster centers are computed by certain reliable theories and rigorous procedures; such that the obtained cluster centers can well represent a cluster and all affiliated samples in a cluster. To resist the negative transfer, our objective is to discard bad cluster centers in the source domain and select helpful cluster centers that can help the clustering task satisfactorily. Let we have a total of N SD training images in the source domain x i;s ðx i;s 2 R dÂ1 ; i ¼ 1; 2; . . . ; N SD Þ and N TD training images in the target domain x i;t ðx i;t 2 R dÂ1 ; i ¼ 1; 2; . . . ; N TD Þ, where N TD ( N SD . We consider there exists a shared latent space, spanned by a projection matrix Q 2 R rÂd , where r is the dimensions of the shared latent space. In this way, the known cluster centers vSD h ðh ¼ 1; 2; . . . ; C SD ) in the source domain obtained by a certain clustering method could be represented as Qv SD h . The projection of a target domain sample x i;t could be represented as Qx i;t . Suppose ṽTD j ðj ¼ 1; 2; . . . ; C TD ) is the unsolved cluster centers in the target domain in the shared latent space. We consider the following optimization term for resisting negative transfer: where the parameter S jh is called the weight of transfer knowledge, and its value is in the range ½0; 1. S jh denotes the matching degree between the jth cluster center of the target domain and the hth cluster center of the source domain. To find useful transfer knowledge from the cluster centers in the source domain, it is needed to devise a strategy to set the values of S jh to high values for positive transfer and low values for negative transfer. In Eq. ( 4), we set S jh as follows: When S jh tends to 1, ṽTD j exactly matches Qv SD h . In this case, the clustering results will be coherent and these two centers clusters of different domains are much closer to each other. When S jh tends to 0, ṽTD j does not match Qv SD h . In this case, we make Qv SD h participate in transfer learning as little as possible. That is to say, the transfer performance will be at least no worse than performing the target clustering without transfer. In other words, if the source clustering transfer ability of Qv SD h decreases cluster performance of target domain data, it means the partial source clustering may be not related or the relationship is not sufficiently leveraged, then the negative transfer has occurred. By adjusting the value of Qv SD h , Eq. ( 4) can help the transfer model make positive transfer when two domains are appropriately matched and resist negative transfer when two domains are not matched. At one extreme, S jh is set to be 1, the transferred knowledge from the source domain are completely helpful, such that the cluster centers in the source and target domains are coincided with each other, and all transferred knowledge are completely adopted. At the other extreme, when S jh tends to 0, it means the transferred knowledge from the source domain are unhelpful. The clustering on the target domain will disregard the transferred knowledge. But in most cases part transferred knowledge are selectively keep and the other parts are disregard. To find a proper projection matrix Q, we think the difference between source and target domains in the shared latent space should be as small as possible, such that the relationship between domains is strengthened, and the transfer knowledge of data in the source domain will be more helpful to complete medical segmentation in the target domain. Based on the definition of MMD, the difference between two domains in the shared latent space can be computed as follows The distribution difference between source and target domains is simply the distance between the two mean in the shared latent space. Let The optimization of dðP source ; P target Þ can be simplified as where I rÂr is a r Â r identity matrix, such that the projection matrix H is orthogonal. Coming to the transfer learning tasks, we incorporate Eqs. ( 4) and ( 8) into the FCM framework. We obtain the objective function of NTR-FC-SCT as follows: where parameters 1 > 0 and 2 > 0 are the coefficients of transfer optimization term and MMD term, respectively. In NTR-FC-SCT, the parameter 1 is used to control the influence of transfer optimization term P C TD j¼1 P C SD h¼1 kṽ TD j À S jh Qv SD h k 2 to the entire objective function. The larger the 1 value, the greater the contribution of the transfer term will be. In this case, the unsolved cluster centers ṽTD j in the target domain should be close to S jh Qv SD h in the shared latent space. Conversely, when 1 tends to 0, the contribution of the transfer term is weakened, the difference between the unsolved cluster centers and known cluster centers in two different domains can be relaxed. The solution of objective function in Eq. ( 9) relates to the matrixes Q, U and Ṽ. In the following, we optimize them one by one using the iteratively optimization strategy. In terms of the Lagrange optimization, the minimization of J in Eq. ( 9) by introducing the Lagrangian multiplier a in Eq. ( 9) can be converted to the following unconstrained minimization problem: In the first step, we fix parameters Q and U, and only consider Ṽ. To minimize this objective on parameter Ṽ, we set the derivative with regard to Ṽ to zero: We can get Ṽ in a closed form as follows Likewise, in the next step, we fix parameters Q and Ṽ, and only consider U. The minimization problem of Eq. ( 10) with respect to U can be equivalent to the following problem, In light of In the next step, we update matrix Q and fix parameters Ṽ and U. Let Ũ1 ¼ ½m 11 ; . . . ; mi1 ; . . . ; mN TD 1 2 R 1ÂN TD ; ; (15) where where where q i ¼ ½v TD i ; . . . ; v TD i |fflfflfflfflfflfflfflfflffl ffl{zfflfflfflfflfflfflfflfflffl ffl} 2 R rÂN TD . Substituting Eqs. ( 16), ( 17) and ( 18) back to Eq. ( 9), the minimization problem of Eq. ( 10) with respect to Q can be equivalent to the following problem, where : Likewise, the minimization problem of Eq. ( 10) with respect to Q can be equivalent to the following problem, In this study, the widely gradient descent method is adopted to compute the optimal Q. By setting the initial value Q as Q 0 , the gradient descent method successively optimal Q as follows where h is the learning rate and l is the iteration number. Considering the constraint of QQ T ¼ I. After each updating step of Q l , let Q l ¼ Q l 0 R be the QR decomposition of Q l , where Q l 0 has orthogonal columns and R is an upper triangle. Then we replace Q l with Q l 0 for the next iteration. Eq. ( 19) will be iteratively solved until the convergence condition is satisfied. Based on the above analysis, the proposed NTR-FC-SCT model is presented in Algorithm 1. We use ultrashort echo time (UTE) and modified Dixon brain image datasets [39], [40]. It consists of 256 brain CT image slices of 10 patients, with each image of a resolution of 256 Â 256 pixels. All CT images with corresponding manual segmentation are segmented into three classes: bone, water and soft issues. These class labels are assigned by physicians or technicians. We randomly select 20 brain CT images as the original target domain data, and the rest 236 brain CT images as source domain data. We consider the application of NTR-FC-SCT in the scenario of target images polluted by noise. To this aim, all target images were corrupted by 5, 10, 15, 20, 25 and 30 percent Gaussian noise. The example images in the source and target domains are shown in Fig. 3. Following the training protocol established in [41], we construct a total training data set combining 236 source brain images and random 8 target brain images, while the remaining 12 target brain images are used as testing brain images. We repeat the experiment for 10 runs and record the experimental results. Initialize Set the maximum number of iterations t max , the fuzzy index m, the regularization parameters 1 and 2 , and the learning rate h. Repeat: Exacting transfer knowledge form the source domain; Perform soft-partition clustering methods in the source domain, such as FCM, and obtain the cluster centers of data in the source domain; Initialize the clustering centers of data in the target domain; Compute the weight of transfer knowledge S jh using Eq. ( 10); Fix UðtÞ and Q(t), obtain ṼTD (t) using Eq. ( 12); Fix ṼTD (t) and Q(t), obtain U(t) using Eq. ( 14); Fix U(t) and ṼTD (t), obtain Q(t) using Eqs. ( 18) and ( 19); Compute J(t) using Eq. ( 9); Until kJðtÞ À Jðt À 1Þk d or t ! t max ; To compare the segmentation performance of NTR-FC-SCT with that of existing methods, complete image segmentation is obtained and compared with segmentations obtained by FCM [27], transfer spectral clustering (TSC) [24], and type-I knowledge-transfer-oriented c-means (T1-KT-FCM) [28]. As introduced in Section 2, FCM is the baseline algorithm of NTR-FC-SCT. TSC performs transfer learning based on bipartite graph co-clustering, which adopts both the data manifold and sample manifold shared among different domains. T1-KT-FCM makes the cluster centers in the source domain as the transfer information to control the knowledge transfer in the test images. T1-KT-FCM incorporates this idea into FCM to achieve automatic image segmentation. To obtain the optimal parameters in all four methods, the common used grid search is conducted. Fuzzy index m in all fuzzy clusters is set within the grid f1:1; 1:5; 2; 2:5g. The K-nearest parameters in TSC are set within the grid f0; 0:005; 0:1; 0:5; 0:7; 1; 1:5; 10; 50; 100g. The ; g parameters in T1-KT-FCM are set within the grid f10e À 4; 10e À 3; . . . ; 10e4g. The parameters 1 ; 2 in NTR-FC-SCT are set within the grid f0; 10e À 4; 10e À 3; . . . ; 10e6g, learning rate h in NTR-FC-SCT are set within the grid f1e À 4; 1e À 3; 1e À 2g, and the maximum number of iterations is 10e5. In this study, the performance of image segmentation by clustering methods is evaluated in terms of two validity indicators: normalized mutual information (NMI) [42] and adjusted rand index (ARI) [43]. NMI and ARI can efficiently evaluate the agreement degree between the known clusters and the estimated data structure. Both NMI and ARI take values from 0 to 1, and larger value means better cluster performance. Experimental environment is Intel Core i3-4170 3.7 GHz CPU and 12 GM RAM, Windows 10, and MATLAB R2016a in this study. The clustering performance of four methods is reported in the following. The mean and standard deviation of NMI and ARI for all compared clustering methods are displayed in Tables 1, 2, 3, 4, 5, 6, respectively. The experimental results show that three transfer learning methods are superior to FCM. The introduction of transfer knowledge from source domain has indeed promoted the cluster performance of data in the target domain. FCM is not a transfer learning cluster method which simply combines the source domain and target domain data as the training data. Due to underlying noise or outliers in the target domain, the distribution difference between source and target domains are significant different. Thus, FCM can not obtain good clustering performance in terms of NMI and ARI. Our model achieves the best performance in all datasets. TSC may be not suitable for the transfer scenario in noisy medical image segmentation, since the character of medical image are usually different in noisy scenario, while the manifold and sample manifold shared among different domains can not resist negative transfer for TSC. T1-KT-FCM exploits the transfer knowledge across domains in the original data space; however, the limited transfer knowledge can not be fully exploited in such original space. NTR-FC-SCT has shown better performance than the other comparison methods in terms of NMI and ARI. Both the reliable knowledge obtained in the source domain and the ability of resisting negative transfer has the important influence on the segmentation performance of NTR-FC-SCT. To better observe the behavior of all     noisy scenario. The regularization term in NTR-FC-SCT ð 1 ¼ 0Þ is Q T VQ, which finds a shared latent space for data cross domains, so that the projection data distributions of the source and target domains are close to each other. NTR-FC-SCT has the advantages of both NTR-FC-SCT ð 1 ¼ 0Þ and NTR-FC-SCT ð 2 ¼ 0Þ. It can exploit more transfer knowledge; meanwhile, and achieve a good balance between making use of positive transfer and resisting negative transfer. Next, we discuss the influence of the number of samples in the source domain on the performance of NTR-FC-SCT. We randomly select 10, 30, 50, 70, 90 and 100 percent proportion of training samples in the source domain as the source training dataset. To make the results fair, we repeat the above sampling 10 times for each sample size. NMI and ARI performances of NTR-FC-SCT on Subject1 and Subject2 with 5 percent noisy are shown in Figs. 10 and11, respectively. The experimental results show that the values of NMI and ARI increase with the increase of the number of samples in the source domain. The reason is that NTR-FC-SCT can not mine enough transfer knowledge from source domain when training samples in the source domain are too few. On the other hand, exploiting clear and concise transfer knowledge need a certain amount of high quality samples in the source domain. Thus, it can be inferred that the more samples in the source domain, the more helpful the knowledge obtained in the source domain and the more efficient the NTR-FC-SCT will be in the target domain. In the experiments, the parameters 1 and 2 are determined in a given search grid. In the following, we discuss the performance of NTR-FC-SCT using different parameters. Tables 15,16 show the means of NMI and ARI on the subject using different 1 and 2 , while fixing the parameter m ¼ 2. 1) NTR-FC-SCT is sensitive to parameters 1 and 2 . Different 1 and 2 lend to different cluster performance of NTR-FC-SCT in terms of NMI and ARI. It can be found that in most situations when the value of NMI is better, the value of ARI is also better. Thus, it is feasible to use NMI and ARI as performance criterions to determine the suitable parameters. 2) Fixed the value of m, NTR-FC-SCT obtains the worst NMI and ARI when 1 ¼ 0 and 2 ¼ 0. The clustering performance of NTR-FC-SCT is improved when 1 and 2 are not equal to 0. Since when 1 ¼ 0 and 2 ¼ 0 NTR-FC-SCT is degenerated to the classical FCM clustering. 3) We can find that when the value of 1 is large, NTR-FC-SCT obtains the satisfactory performance in terms of NMI and ARI. This further demonstrates that the proposed negative-transfer-resistance mechanism has played an effective role. Thus, in the subsequent experiments, we can reduce the search grid of 1 in the range f0; 10e À 4; . . . ; 10e6g. We can't find the rule to select parameter 2 . We think it is reasonable to select optimal 2 within the search grid. The range f0; 10e À 4; . . . ; 10e6g is appropriate. In this study, we have addressed the problem of medical image segmentation with insufficient and noisy samples, and proposed NTR-FC-SCT model for leveraging source knowledge to improve the segmentation performance of target domain. We explore the negative-transfer-resistant mechanism to reinforce the influence of positive transfer and reduce, or even eliminate, the negative transfer. In particular, we find a shared latent space based on the idea of MMD, in which the mapped data distributions of source domain and target domain are close to each other. The experiments focus on noisy brain CT images. The experimental results show that with insufficient and noisy medical images, it is possible to build an efficient segmentation model with the help of medical images from the related scenarios. Future work will extend our algorithm to other medical image segmentation applications. We will extend the framework so as to apply various clustering algorithms in order to obtain more satisfactory medical image segmentation results. We will also study how many images in the source domain can be considered sufficient, and how to select the important images to further improve the transfer. In addition, how to speed up NTR-FC-SCT is worthy to be studied in the future. Authorized licensed use limited to: Queen Mary University of London. Downloaded on March 22,2025 at 21:28:40 UTC from IEEE Xplore. Restrictions apply. IEEE/ACM TRANSACTIONS ON COMPUTATIONAL BIOLOGY AND BIOINFORMATICS, VOL. 18, NO. 1, JANUARY/FEBRUARY 2021 Authorized licensed use limited to: Queen Mary University of London. Downloaded on March 22,2025 at 21:28:40 UTC from IEEE Xplore. Restrictions apply. Yizhang Jiang (M'12-SM'19) received the PhD degree from Jiangnan University, in 2015. He has also been a research assistant in the Department of Computing, Hong Kong Polytechnic University, for two years. His research interests include pattern recognition, intelligent computation and their applications. He is the author/co-author of more than 40 research papers in international/national journals, including the IEEE Trans. on Fuzzy Systems, IEEE Trans. on Neural Networks and Learning Systems, IEEE Trans. on Cybernetics, and Information Sciences. He is an associate editor of the IEEE Access (2019-). He has served as a reviewer or co-reviewer of several international conferences and journals, such as ICDM, IEEE Transactions on Knowledge and Data Engineering, IEEE Transactions on Fuzzy Systems, the IEEE Transactions on Neural Networks and Learning Systems, Pattern Recognition, Neurocomputing, and Neural Computing & Applications. He has also served as a leader guest editor or guest editor of several international journals, such as journal of the Ambient Intelligence and Humanized Computing, Computational and Mathematical Methods in Medicine, and Frontiers in Neuroscience. He is a Senior member of the IEEE. JIANG ET AL.: NOVEL NEGATIVE-TRANSFER-RESISTANT FUZZY CLUSTERING MODEL WITH A SHARED CROSS-DOMAIN TRANSFER. . .",
  "filePath": "C:\\Users\\Alex Isaev\\Documents\\truth source\\citation-verifier\\src\\document-database\\pdf-documents\\A_Novel_Negative-Transfer-Resistant_Fuzzy_Clustering_Model_With_a_Shared_Cross-Domain_Transfer_Latent_Space_and_its_Application_to_Brain_CT_Image_Segmentation.pdf",
  "doi": "10.1109/TCBB.2019.2963873"
}