{
  "id": "a_study_on_the_comprehensive_indicator_of_indoor_environment_assessment_for_occu",
  "title": "A study on the comprehensive indicator of indoor environment assessment for occupants' health in Taiwan",
  "authors": [
    "Che-MingChiang",
    "Chi-MingLai"
  ],
  "content": "It is a common consensus within the \"green building\" activities that indoor-environment issue has to be an essential part of the global sustainability. There is a worldwide trend to develop a system that can provide comprehensive performance-assessments of buildings in di erent environmental scales: global, local and indoor issue. The government of Taiwan is toward this trend. One of the main areas of an environmental assessment method under development is the impact of the indoor environment on occupants' health. Chen et al. [1] mentioned that indoor environment is important for people's health and welfare, because up to 90% of a typical person's time is spent indoors. Their productivity is also highly related to the indoor environment. Arthur Rosenfeld, a senior advisor at the US Department of Energy (1998), cited a cost=beneÿt analysis of high-e ciency ÿltration in an o ce building. The costs are $23 a person for ÿlters and $1 a person for energy. The beneÿts are $39 a person from a 10% decrease in respiratory disease; $70 a person from a 1% increase in productivity among the 20% of workers who are allergic; and $90 a person by decreasing the productivity loss from building-related illness from 1% to 0.75%. Those show a strong relationship between IAQ and productivity, and serious initiatives to improve indoor environment have a tremendous return. Chiang et al. [2,3] pointed out that occupants in a built-environment (illumination, acoustics, air quality, diet, thermal comfort and social environment) re ect the situation, which surrounds them by their physiological and mental sensations (sight, hearing, smell, taste, touch and mentality). The indoor environment is complex and made up of many factors. It is necessary to take various aspects of those environmental factors into consideration, when dealing with the in uence of built-environment on occupants. To begin with, we analyze the indoor-environmental performance and quality in terms of various environmental categories: acoustics, illumination, thermal comfort, IAQ, 0360-1323/02/$ -see front matter c 2002 Elsevier Science Ltd. All rights reserved. PII: S 0 3 6 0 -1 3 2 3 ( 0 1 ) 0 0 0 3 4 -8 vibration and electromagnetic ÿeld, as shown in Fig. 1. Each environmental category is then expressed in its relevant indicators (for example: the acoustic environment can be assessed by TNEL 30 , L eq 24H : : : etc.) as illustrated in Table 1 (indicators in precise version). There are 48 items of the total indicators as the precise version, then, due to the consideration of the practicable, economic and acceptable aspects, we select 23 items of those signiÿcant indicators for simplifying the assessment process as the practical version. The analytic hierarchy process (AHP) method, which was developed by Satty [4] is carried out to do the weighting among eight categories and those indicators in the same category in practical version, respectively. Expertise with respect to every professional ÿeld was involved in the process of deciding the relevant weight. These indicators, then, were classiÿed into the independent categories to set up the hierarchy. The nominal-ratio scale of pairwise comparison among the indicators represented as the score from 1 to 9 was adopted, which was ÿlled in a positive reciprocal matrix to calculate the eigenvector and eigenvalue. The consistency ratio was obtained to ÿlter out the null questionnaire when the value of the consistency index (C.I.) was greater than 0.1. For each category, the weighting value was obtained by the geometric mean of experts' questionnaires. The number of experts under consultation is 12, inclusive of ÿve architects, three professional engineers and four professors. Fig. 2 shows the results of the AHP analysis from the experts' questionnaires. The original weighting is listed in sequencing: \"IAQ\" (0.221), \"Thermal comfort\" (0.159), \"Acoustics\" (0.155), \"Illumination\" (0.125), \"EMF\" (0.103), \"Greens\" (0.070), \"Vibration\" (0.054) and \"Water quality\" (0.051). The result indicates the opinions from the experts on the practical aspects of the recent period and the domestic situation. According to convenience, the minor categories whose weightings were less than 0.1 were ÿltered out. It means that the in uence ratio of each minor category is less than 10% of whole beneÿt for the recent environment. Fig. 3 shows the results after the adjustment, there are ÿve categories left, and the adjusted weighting is listed in sequencing: \"IAQ\" (0.290), \"Thermal comfort\" (0.208), \"Acoustics\" (0.203), \"Illumination\" (0.164) and \"EMF\" (0.135). The advised indicators are decided eventually via considering experts' suggestions and their relative weightings (AHP results). Due to the restriction of space of publication, the process of experts' consulting and AHP results are not recorded in detail in this study. Advised indicators are introduced in the left column of Table 2. In \"Acoustics\" category, two indicators, the equalized sound pressure Leq24H for dwellings and LeqD for o ces, were included. In \"Illumination\" category, four indicators, including the intensity of illuminance for the ambiance and the operated face, uniformity ratio and daylight-use ratio, were used for assessment. In \"Thermal Comfort\" category, there were four indicators for assessment, including indoor temperature in various season, relative humidity, air velocity and PMV. In \"IAQ\" category, ÿve common indoor air pollutants were appointed as the characteristic compounds. In \"EMF\" category, the electric-ÿeld intensity and the magnetic ux of the extremely low frequency (50=60 Hz) were used. Especially when evaluating the indicators we used to present the thermal comfort felt by the occupants, we could easily ÿgure out from the relative weightings that the applicability of PMV far exceeded the other three cursors, which signiÿes thermal comfort felt by the occupants in terms of the feasibility and convenience. Bearing in mind that it is the direct feeling toward temperature, humidity and air velocity in the surroundings that a ect the general public, so even it is relatively convenient to use PMV in academic researches, it will, however, require more time and explanation to win the recognition and understanding from the common people. That is why, we suggest in this paper that all four indicators should be taken into consideration, so as to get a balance between the evaluation results of the academic research and the practicability. Table 2 also shows the relationship between the evaluated score and the ÿeld-measurement magnitude. The manner of score-evaluation was represented a ÿve-interval scale, divided from the physical magnitude, and used a set of references as the benchmarks for determining the scores of 20, 40, 60, 80 and 100. Here, the references corresponded to the  score 60 were referred to the criteria of the standard adopted widely for human health, recommended values and building codes. In the similar manner of risk assessment, presented by Anderson [5], Hult [6] and Chiang [7], we propose a comprehensive index, indoor environment index (IEI (AHP) ), to evaluate the indoor environment. It is assumed that there is an integrated e ect accumulated from every category of physical-environment impact on occupants' health. Therefore, the index IEI (AHP) shown in Eq. ( 1) is based on the summation of S x , the evaluated score of the physical-environment category x, multiplied by W x , the weighting of the physical-environment category x (Fig. 3). (2) It means occupants were caused the sanitary risk by the exposure to an indoor environment whose evaluated score of any indicator is less than 60, respectively. For examples, results of ÿeld-measurements of the thermal environment in apartment A are shown in Table 3. Scores of temperature, relative humidity, air velocity and PMV all exceed 60, the score of the thermal environment is (80 + 100 + 100 + 100)=4 = 95. A contrary example is shown in Table 4. Temperature in apartment B is 29 • C and the score is 40. Due to the prerequisite of avoiding risk, the score of the thermal environment, S Thermal Comfort , is 40 unconditionally. Then, we can get S Acoustics ; S Illumination ; S IAQ and S EMF , respectively, in the same manner and put them into Eq. ( 1) to obtain the value of IEI (AHP) . The presented results, announced a set of physical indicators, the weightings of various physical categories and evaluated scales corresponded to the ÿeld-measured values, are feasible for the assessment on the built environment to beneÿt the occupants' health. The experts' opinions, based on the recent situation and the domestic environment, were applied. The project is now proposed to continue with the ÿeld measurement and occupants' questionnaire to make up the assessment system, especially on identifying the weightings and the evaluated scales. Also, for a planned building, the project is proposing to develop the assessment method, which suit to the planned building. The same structure will be used, but the input will be taken the place of the data obtained from the checklists, including the quality assurance system, drawings, and descriptions of a building. From many aspects, it is more di cult to predict future. Illumination Average illuminance at the targeted face Average artiÿcial illuminance at the targeted face Uniformity ratio of illuminance at the targeted face Uniformity ratio of artiÿcial illuminance at the targeted face Ratio of daylight-use Direct glare at the window face Discomfort glare of lamps Color temperature of lamps Color rendering index",
  "filePath": "C:\\Users\\Alex Isaev\\Documents\\truth source\\citation-verifier\\src\\document-database\\documents\\a_study_on_the_comprehensive_indicator_of_indoor_environment_assessment_for_occu.json",
  "sourcePdf": "C:\\Users\\Alex Isaev\\Documents\\truth source\\citation-verifier\\src\\document-database\\pdf-documents\\1-s2.0-S0360132301000348-main.pdf",
  "doi": "EB405B1EACC2864968517EEFA5C23867",
  "year": "",
  "journal": ""
}