{
  "id": "finger_vein_image_enhancement_based_on_guided_tri_gaussian_filters",
  "title": "Finger Vein Image Enhancement Based on Guided Tri-Gaussian Filters",
  "authors": [
    "LipingZhang",
    "XinranWang",
    "XiaoliDong",
    "LinjunSun",
    "WeiweiCai",
    "XinNing",
    "HayleyDawson"
  ],
  "content": "Finger vein recognition is a kind of biometric recognition technology [1,2]. The principle of this technology is to use the absorption property of hemoglobin in finger vein blood to short-wave near-infrared light to collect vein image and then carry out identity recognition. Thus, when near-infrared light (760-850nm) is applied to the finger, dark pixels are formed in the vein region in the captured images. However, blurring light source, skin scattering, uneven finger thickness, various vascular thickness, and other factors will result in low contrast between vein pattern region and non-pattern region in finger vein image, which stands in the way of later extracting feature. Such kind of interference factor is severe for methods based on detail point or grain segmentation. Many previous studies have developed different finger vein image enhancement methods to overcome the problem of finger vein recognition performance degradation caused by fuzzy input image. Among the extant methods of finger vein image enhancement, the most common one is based on various filters. Zhang et al. proposed Combination of Gray-Level Grouping and Circular Gabor Filter, an enhancement method, which can provide the contrast of vein images and reduce illumination changes, and Circular Gabor Filter is used to enhance vein patterns [3]. Yang et al. proposed a Multi-Channel Gabor Filter enhancement method, a reconstruction rule was used to mix the venous information obtained by Gabor filters with different scales and orientations [4]. Lee et al. proposed an enhancement method to deal with skin scattering and optical blurring problems. This method applies Point Diffusion Equation and Least Square Filter with Constraints [5]. Li et al. used Ridgelet Transform to enhance the high-frequency information of images, which could better deal with the singularity and edge enhancement of the two-dimensional curve of finger vein [6]. Vlachos et al. adopted a compound filter to enhance venous details [7]. Shin et al. proposed a fuzzy-based fusion enhancement method with Gabor and Retinex filtering [8]. Cao et al. proposed an enhancement method based on edge detection weighted guided filtering to solve the problem that the guided filtering could not highlight the detailed information of vein texture. In this method, an edge operator was set to punish the normalization factor in the guided filtering to improve the effect [9]. Ho et al. proposed an enhancement method based on using the direction and thickness of vein lines, which used adaptive Gabor to select an optimal direction of veins, applied morphological operations in the filtered image, and finally achieved the enhancement effect by fusion with the original image [10]. Shi et al. proposed an enhancement method based on scattering removal and even symmetric Gabor filter banks, which takes into account light propagation behavior in biological tissues and changes in the direction and diameter of vein patterns [11]. Pi et al. firstly used edgepreserving filter reducing noise and elliptical high-pass filter enhancing images, and on this basis, used histogram equalization to enhance image contrast [12]. Wang et al. designed a morphological image enhancement method by using genetic programming [13]. To solve the problem of light scattering more effectively, Yang et al. proposed a multi-layer PSF and BOM fusion enhancement method [14]. Although these methods can enhance finger vein patterns and take noise suppression into consideration, the noise will also be enhanced in the processed image, which also has a negative impact on recognition. A GTGFs finger vein image enhancement method is proposed in this paper. The method firstly enhanced the vein image through the guided filter, then designed a simple gradient neighborhood average filtering method to filter out noise caused by the equipment, and finally conducted a local enhancement by applying the tri-Gaussian model on the classic lateral suppression receptive field. Figure 1 shows the overall processing flow chart of the proposed method. The input is the ROI image through the finger vein, and the output is the final processing result. The size and resolution of the image are not changed during the whole processing process. The guided filter is essentially a linear model [15]. By constructing a general linear transform filtering process, which contains the guided graph, the input image, and the output image, where the boot diagram and the input image are all known, the value of the output image in pixel i can be represented as a weighted average within a window. where i, j is the pixel index, weight ij W determined by guided graph G, which is completely independent from the input image. In the guided filtering, it is assumed that there is a local linear transformation relation between the guide graph G and the filtering output q, that is, it is assumed that q is the linear transformation of G in a two-dimensional window k  centered on pixel k, which is expressed as follows: , . In the above formula, ( , ) are the fixed linear coefficients in the window. Because of q a G    , the output image q and G have the same edge, in other words, guide graph G can determine the weights used in the weighted average. The guide graph can be a single image or equal to the input image p. When the input image is used as the guide graph, the guided filtering is an edge-preserving filter. To determine the parameters ( , ) k k a b , building a cost function that calculates the difference between input and output in each window k where  is a regularization parameter to prevent excessive size. The optimal solution of the above equation can be obtained by using linear regression method:  . According to the obtained coefficients, the pixel value of the corresponding point of the output image can be calculated: where, i a , i b is the mean value of k a , k b of all windows that cover pixel point i. Substitute the above results into Equation ( 1) to obtain the expression of the filter weight parameters: Because the information provided by the guide graph is mainly used to indicate which is the edge or which is a region, the local linear relationship between graph G and q is designed. If the guide graph detects that this area is detected, then it will smooth the filtering result. If the guided graph detects that the region is an edge, it will try to keep the edge information in the filtering results. When the guided graph G and the input graph I are the same image, it becomes the self-guided filtering, which is used as an image enhancement filter, and its processing effect is similar to that of the bilateral filter, where the window radius is the smoothing radius, and the parameter is the smoothing parameter. The larger the value is, the more obvious, the smoother it will be. In the finger vein recognition task, the input is the finger vein image, and the vein patterns in the image are the information we need (which can be regarded as the edge information), while most of the rest of the finger body is the regional information is not essential. Therefore, guided filtering can be used to achieve finger vein patterns enhancement. In this paper, self-guided image filtering is adopted, which makes the guide graph G equaling I. To filter the noise points enhanced by guided filtering and keep the pixel value of the normal points unchanged, a simple gradient neighborhood mean filtering method is adopted. The specific processing process is as follows: (1) For each pixel point, set a neighborhood window w of a specific size to calculate the neighborhood average value corresponding to this point. (2) Calculate the gradient values in the four directions of the pixel. (3) If one of the four gradient values is greater than the set threshold, the point will be judged as an abnormal point. The neighborhood average value will replace the grey value of the abnormal point in Step 1, and the remaining points will keep the original pixel unchanged. Based on the classical receptive field model, the Disinhibitory Properties of the Concentric Receptive Field (DRF) [16] added an excitatory edge region, which mainly played a role in disinhibition. Compared with the middle zone and the surrounding zone, the edge zone has weaker intensity and a more extensive effective range, as shown in Fig. 2. The tri-Gaussian model based on DRF [17] adds a Gaussian function based on the classical Gaussian difference model to represent the action mechanism of the edge excitation region of DRF. The mathematical formula of the specific model is as follows: where, the meaning of 1  mean the same as in classical receptive field model, 3 A , 3  are the peak coefficient and the standard deviation of Gaussian envelope of the edge region. The finger vein image is mainly composed of vein patterns and background information. The one that needs to be enhanced is vein patterns information. In addition to reflecting the network information such as the direction, crossing and connection of veins, finger vein image contains the information of vein width. For example, the main vein is wide, and the branch vein is narrow. Therefore, according to the structural properties of the finger vein image, by observing the ROI image of the SEMI-FV dataset (neither guided filtering nor gradient neighborhood means filtering changes the resolution and size of the image), it can be found that the vein width of the dataset occupies about 6-pixel width. In order to enhance the vein patterns, set 1 3 2 t    . Combined with the response properties of the tri-Gaussian model [16], the value of 6 parameters in Equation ( 7) is finally determined, as shown in Table 1.  Surrounding area 2 7 Edge area 1 11 The finger vein database for experiment was established by using the self-developed finger vein image acquisition device [19,20]. The self-built finger vein dataset contains 2,610 images from 29 people. Index finger, middle finger and ring finger are collected from each person's left and right hands. Each collection is carried out in a cycle of 6 fingers to increase the randomness of each finger press. The original collected image is shown in Fig. 4, with an image size of 640 480  . We perform two types of experiments to validate the proposed GTGFs. First, we analyze the visual effects of each part of the proposed method. Then, we binarize the output image after each part of the proposed method and test the recognize performance of the binary images. In identification test, each finger being treated as an independent object. With each object, the first five images are regarded as the training images, the remaining 10 images used in the test process. By calculating the compatibility between the two images and using the nearest neighbor classification, we obtain the measurement results of each test image for each category. Taking the Equal Error Rate (EER) as the measurement index, there were 1740 positive sample matching times ( 174 10  ) and 301,020 negative sample matching times (174 173 10   ). As shown in Fig. 5, each image shows the effect after processing of each step in the flow. Based on vein enhancement with guided filter, vein patterns enhanced after processing. However, noise can also be amplified. Through carefully observing the enhanced image noise points, we found that the part of the noise may be caused by acquisition equipment (the dust on the acquisition camera), and its noise type is similar to Gaussian noise. Although the principle of the designed gradient neighborhood mean filtering is simple, it can effectively filter the noise of the image without changing the effective point information of the image and keep the original vein patterns information of the image as much as possible. Although the normal pixel value of the image can not be changed by the gradient neighborhood mean filtering, the image near the abnormal point is obviously blurred after filtering. On this basis, adding the tri-Gaussian image enhancement algorithm process can further enhance the vein patterns, especially in the local area. The pre-processed image is binarized by setting a fixed threshold value, and then Hausdorff distance matching is carried out directly on the binarized image matching. The binary images processed by each method are shown in Fig. 6, and the EER results of different pre-processing methods are shown in Table 2. In the above two groups of experiments, it can be seen from the results of Experiment 1 that after the processing of the proposed method, vein images have a significant enhancement effect, and the noise brought by the equipment can be filtered, and the visual effect is noticeable. Experiment 2 shows that the proposed finger vein image enhancement method can improve the accuracy of vein segmentation and recognition. However, since the binarization method in Experiment 2 adopts the simplest threshold binarization, and the matching is also simple Hausdorff distance matching, the recognition effect is poor. In this paper, an image enhancement method of finger vein combining guided filtering and tri-Gaussian model is proposed. The method contains three parts: guided filtering, gradient neighborhood mean filtering and three-Gaussian image enhancement. First, a self-guided filter is formed by setting the input image as the guide graph to enhance the finger vein patterns. In order to filter out the noise points which are also enhanced, a simple gradient neighborhood mean filtering strategy is adopted. Finally, according to the properties of finger vein patterns, parameters were set and the image of finger vein was enhanced by the tri-Gaussian model. The experimental results show that the image processed by the method can achieve good results in the aspects of preserving the structure of finger vein, local processing and suppressing noise points. Xinran Wang, an undergraduate student at Beijing University of Posts and Telecommunications, whose research interests include machine learning, deep learning, collaborative training, and image generation algorithms.",
  "filePath": "C:\\Users\\Alex Isaev\\Documents\\truth source\\citation-verifier\\src\\document-database\\pdf-documents\\tpris-12.pdf",
  "year": "2021",
  "doi": "DAAF7D1BD0F4FAC9C35F8A9D842D0F85"
}