{
  "id": "reliability_and_validity_of_comprehensive_health_status_measures_in_children_the",
  "title": "Reliability and validity of comprehensive health status measures in children: The Child Health Questionnaire in relation to the Health Utilities Index",
  "authors": [
    "HeinRaat",
    "GoukeJBonsel",
    "Marie-LouiseEssink-Bot",
    "JeanneMLandgraf",
    "ReinoudJ B JGemke",
    "Department of Public Health\n\t\t\t\t\t\t\t\tErasmus University\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tP.O. Box 1738\n\t\t\t\t\t\t\t\t\t3000 DR\n\t\t\t\t\t\t\t\t\tRotterdam\n\t\t\t\t\t\t\t\t\tThe Netherlands"
  ],
  "content": "With the increase of chronic diseases in children, traditional medical indicators of outcome (e.g., survival, symptom status, blood chemistry) no longer suffice. The comprehensive assessment of health status or health-related quality of life, including physical, psychological and social domains, is required to complement clinical measures. Generic measures assess health status in a non-disease-specific way and claim to be applicable in a wide range of populations: in general population samples (e.g., for \"burden of disease\" descriptive studies and effect studies of community interventions) as well as in varied clinical samples [1][2][3][4]. For adults, several validated, multi-language questionnaires are available, such as the SF-36, the Sickness Impact Profile, Nottingham Health Profile, the COOP/WONCA Charts and the EQ-5D [1]. Health status measurement in children, however, is still at a developmental stage [2][3][4][5][6][7][8][9][10]. The Child Health Questionnaire (CHQ) has been proposed as a broadly applicable health status measure in children covering physical and psychosocial domains [6,11]. The CHQ utilizes the same structure and methodological approach as the SF-36. However, it was developed specifically for children and adolescents and therefore includes salient domains such as self-esteem and family functioning that are not found in tools for adults such as the SF-36. The CHQ has been applied in general populations as well as in studies with chronically ill children in several countries [6,11,12]. In the present study, the merits of the 50-item proxy version of the CHQ (CHQ-PF50) were assessed. The CHQ-PF50 is suitable for parents of children aged 4 years and older. The Health Utilities Index mark 2 (HUI2), was chosen to evaluate the concurrent validity of the CHQ, as it is a widely applied alternative pediatric health status measure which has been validated crossculturally [13][14][15]. The aim of this study was to assess: 1. the feasibility of the Child Health Questionnaire (CHQ-PF50) as a proxy measurement (indicators: response rate, missing/non-unique answers); 2. the reliability of the CHQ-PF scales (internal consistency and test-retest reliability); 3. the validity of the CHQ-PF as judged by specific comparisons with the HUI2 (concurrent validity), and the ability to discriminate between groups with/without chronic conditions and with high/low medical consumption (discriminant validity). The study population consisted of 467 schoolchildren in grades 3-8 (5-13 years old) at three representative elemen-tary schools in Rotterdam, the Netherlands. The teachers of each class distributed the health questionnaires to the children, to be handed over by them to their parents (guardians). The children were required to return the forms within 2 weeks. No rewards or other response-increasing policies were applied. After 2 weeks this procedure was repeated in grade 7 (79 children age [10][11], in order to assess test-retest reliability. Two criteria for eligibility for analysis were: (1) the parents' ability to read and write Dutch, and (2) at least an 80% response to CHQ-items. In the case of a missing answer, the answer to the same question of another, randomly chosen respondent was imputed to the data file for the purpose of the analyses. In the case of non-unique answers (more than one answer per question), a random selection of either answer was imputed during analysis as response. The CHQ-PF50 consisting of 50 items divided over 11 multi-item scales and 2 single-item questions (Table 1), was translated into Dutch according to international guidelines Family's ability to get along is rated \"poor\" Family's ability to get along is rated \"excellent\" Change in health (CH) b 1 Child's health is much worse now than 1 year ago Child's health is much better now than 1 year ago a Reproduced with permission [6]. b This concept was not fielded in this study. [11,16,17] foot_0 . Each CHQ scale consists of 3 to 6 items with 4, 5 or 6 response options per item. Following the CHQ standard procedure, the scale item scores (some recoded/recalibrated) were summed and transformed into 0 (worst possible health state) to 100 (best possible health state) scales [6]. \"Physical\" and \"Psychosocial\" CHQ summary scores were calculated following the CHQ standard procedure (a procedure based on a factor-analytical model of a U.S. child population sample), analogous to the construction of the summary scores in the SF-36 [18]. Given the underlying assumption of the CHQ developers that child health should be described by several child domains as well as the impact of child health on parental/family functioning, the CHQsummary scores as proposed by the developers are based the \"child-related\" scales and the \"parental/family-impact\" scales (see discussion) [6]. A \"Physical\" or \"Psychosocial\" summary score of 50 represents the mean in the general population (here: U.S. children). Ten points above/below 50 reflects one standard deviation difference in either direction [6,18]. The HUI2 has six domains (attributes), each with four or five levels (Fig. 1) [7] foot_1 . Contrary to the CHQ, the HUI2 does not consist of multi-item scales, but of an ordinal classification system. A HUI2 classification is either the direct result of expert judgement (doctor/nurse) or of a classification algorithm applied to the respondent's (parent or doctor/ nurse) answers on a standardized questionnaire. The Dutch questionnaire for parents was used to retrieve HUI2 data in this study [13]. Health states described by the HUI2 can be \"valued\" by representatives of a relevant population. These valuations can be used to estimate a multi-attribute utility function for the HUI2. By imputing individual HUI2 score profiles to the Canadian multiattribute utility function, utilities (range 0.0-1.0) indicating overall child health, were calculated. As suggested by Torrance et al. [7] HUI2 domain scores were transformed into \"single-attribute utilities,\" based on the same Canadian data, because these are more likely to have interval properties. Standard socio-demographic data were collected. \"Today's prevalence\" of 11 chronic conditions was measured by the parent questionnaire. A child's medical consumption over the past year was measured by asking about the number of visits to the family physician. Evaluation of feasibility consisted of the assessment of the percentage of missing/non-unique answers at the item level, and the content of written comments. Scale scores were described by conventional descriptive statistics. The CHQ scale-score distributions (as well as scale reliabilities; see below) in the sample of schoolchildren were compared with those in three available reference populations: general U.S. population age 5-18 ( n ϭ 391); mild-to-moderate asthmatic U.S. children ( n ϭ 177); U.S. children with attention deficit hyperactivity disorder (ADHD) ( n ϭ 83) [6]. Cronbach's alpha was used to evaluate the internal consistency of the CHQ scales [19]. We assessed whether correlations (Pearson's Product Moment coefficients) between the items and their own scale score (without the item under consideration) were higher than the correlations between these items and any other scale, to evaluate whether the CHQ items were well chosen and if the scales represent separate entities. Test-retest reliability of the CHQ scales was assessed by test-retest correlations (Intraclass Correlation Coefficients, ICCs) [20], as well as at-group level, by comparison of the mean scores at first/second measurement with Mann-Whitney U-tests, given a non-normal distribution of the data. Concurrent validity was tested whether CHQ scales correlated better with their assumed parallel HUI2 domain (or, failing this, the multiattribute utility score) than with any other domain/score, as measured by Spearman's rank correlation coefficients, considering non-normal distribution of the data. The following CHQ scale/HUI2 domain pairs were defined: \"Physical functioning\"-\" Mobility \"; \"Role functioning-emotional/behavior\"-\" Emotion \"; \"Role functioning-physical\"-\" Pain \"; \"Bodily pain\"-\" Pain \"; \"General behavior\"-\" Emotion \"; \"Mental health\"-\" Emotion \"; \"Selfesteem\"-\" Emotion \". The ability of the CHQ and HUI2 to discriminate between a group of children without any chronic condition and a group with at least two (parent-reported) chronic conditions was assessed. A similar assessment was subsequently made of a group of children with zero medical consumption versus one reporting at least three visits to a physician during the past year. One-sided Mann-Whitney U-tests were applied as it was hypothesized that mean scores would be lower in groups with reported chronic conditions/physician visits. Effect size estimations (d) were calculated which relate the difference in mean scores to the dispersion of the scores: [Mean(a) Ϫ Mean(b)]/ standard  average alpha of the 11 scales is .72. na ϭ not applicable, f ϭ no variability across items, reliability could not be computed [6]. ϭ scale not fielded in this sample [6]. g Physical and Psychosocial CHQ summary scores based on a factor-analytical model on U.S. population samples. A score of 50 represents the mean in the general U.S. population; scores above/below 50 are above/below the average in the general U.S. population [6]. deviation. 3 Following Cohen's suggested guidelines, d ϭ .2 was taken to indicate a small effect size, d ϭ .5 a moderate effect size, and d ϭ .8 a large effect size [21]. Of the 467 questionnaires distributed, 364 were returned (a 78% response). Thirteen were not eligible for analysis (language difficulty n ϭ 9; incomplete n ϭ 4). The retest in grade 7 ( n ϭ 79) had a response rate of 63%. In the absence of a first response, two retest questionnaires were treated as a first measurement. One retest questionnaire was incomplete. The mean age of the parents was 37 years (range 27-56; SD 5); 88% were mothers; 9% were of non-Dutch ethnic origin. The educational background of the parents showed that 28% had completed higher vocational education or university and 43% had at least secondary education. Most parents (54%) were employed. The children ranged from 5 to 13 years of age (mean 8.8); 52% were girls. The age in grade 7 (retest population) ranged from 10 to 11. Forty-four of 50 CHQ items had less than 1% missing answers. The highest percentage found was 2% (\"Satisfaction with athletic ability\"). Forty-five of 50 CHQ-items had less than 1% non-unique answers; the single-item scale \"Family cohesion\" had the highest percentage (4%). The scale \"General health perceptions\" evoked written comments such as \"How should I know\" (regarding expectations for the future). Nevertheless, these items showed few non-unique and missing answers. Mean CHQ scale scores in the physical and role-functioning domains were high and showed very skewed distributions, while \"General behavior,\" \"Mental health,\" \"Selfesteem\" and \"General health perceptions\" showed somewhat lower scores in the Dutch \"schoolchildren\" sample as well as the U.S. \"general population\" sample (Table 2). In the \"Asthma\" and \"ADHD\" samples mean scale scores were only convincingly lower in specific \"affected\" domains. The \"Asthma\" sample showed relatively low \"General health perceptions\" scores and a low \"Physical summary\" score. The \"ADHD\" sample showed relatively low scores on \"Role functioning-emotional/behavior,\" \"General behavior,\" \"Mental health,\" \"Self-esteem,\" \"Parental impactemotional,\" \"Family activities,\" and the \"Psychosocial summary\" (Table 2). The Cronbach's alphas of the CHQ scales averaged .72 (.39-.96) in the Dutch sample, which compares to the Cronbach's alphas in all three (both clinical and non-clinical) reference populations. Only the \"General health perceptions\" scale had a very low .39 alpha in the Dutch sample (Table 2). The item-own scale correlations of the CHQ-scales were considerably higher than most of the corresponding item-other scale correlations (Table 3). Forty-seven test-retest pairs were analyzed. At the individual level, the test-retest correlations (ICCs) of the CHQ scales were statistically significant (.31-.84) for all but two scales (Table 4). Also, the test-retest CHQ \"Psychosocial  Physical and Psychosocial CHQ summary scores based on a factoranalytical model on U.S. population samples. A score of 50 represents the mean in the general U.S. population; scores above/below 50 are above/below the average in the general U.S. population [6]. *P Ͻ .05, **P Ͻ .01. 3 Given unequal score variance between groups, the denominator used in calculating the d statistic was the square root of: summary\" scores correlated well (.79), while the \"Physical summary\" scores did not (.27). The ICCs between first and second measurement showed no level effect. At group level, no significant difference emerged between the test-and retest means of all but one (\"General behavior\") of the scales, and the summary scores. The distributions of HUI2 domain scores are presented in Fig. 1: near to perfect scores (level 1 ϭ best possible health) were achieved in the domains \"Mobility\" and \"Self-care,\" whereas the lowest scores showed up in the domain \"Emotion.\" Of the parent-reported chronic conditions, the prevalence of allergies (11%), eczema (9%), asthma (5%) and \"problems with hearing\" (3%) were highest. Other conditions (vision problems unable to be corrected by glasses/ contact lenses; diabetes; back problems; joint problems; seizures; migraine; depression) were rare ( Ͻ 2%). All CHQ scales, except \"Role functioning-emotional/behavior,\" correlated better with the assumed parallel HUI2domains (.26-.49), than with other domains (Table 5). Also, the CHQ summary scores correlated with appropriate HUI2-domains. Table 6 shows the intermediate-to-strong ability of six CHQ scales and the \"CHQ-Physical summary score\" to discriminate between the subgroup of children without any parent-reported chronic condition and those with two or more conditions. Four CHQ scales and the \"CHQ-Physical summary score\" discriminated well between a subgroup of children who had not visited the family physician at all last year and a subgroup consulting a physician at least three times. This was at least equivalent to the discriminative ability of HUI2 in this study. In our population of predominantly healthy schoolchildren some aspects of the performance of the CHQ were excellent (feasibility), others were good (concurrent and discriminant validity), and still others need further study (test-retest reliability). The performance of the CHQ in this study was at least equivalent to that of the HUI2. The CHQ was well accepted by parents under non-supported conditions, as judged by the high response and few missing/non-unique answers. The appreciation of the CHQ and the HUI2 by respondents with regard to aspects such as readability and perceived relevance has not been studied in this project. Evaluation of the respondents' perspective might be recommended for future studies. A shorter CHQ-PF form than the one applied in this study is currently available, notably a 28-item form [6,11,12]. In general, abridged versions, which omit the less informative items, have been found not to limit group comparisons [22]. However, decreased sensitivity may play a role in individual use, repeated-measures designs and where assessments of rather specific conditions are concerned. A unique feature of the CHQ, which distinguishes it from the SF-36 and from other pediatric questionnaires, are the three family impact scales. They showed good psychometric properties, especially in the ability to discriminate between the presence/absence of chronic conditions. This extension of the health concept is appropriate from a clinical and social perspective. In evaluative applications, these scores must be handled with care. In particular, if changes in the \"family impact\" domains would be incongruent with changes in the domains that directly concern the functioning of the child him/herself, it may be difficult to judge which outcomes are the most relevant in a specific study. To facilitate comparisons of CHQ outcomes between groups, \"Physical\" and \"Psychosocial\" CHQ summary measures have been developed based on a factor-analytical model in a reference population. The psychometric properties of these CHQ summary measures were satisfactory, adequately reflecting the underlying scales within the limitations of this study. The current CHQ summary formulas, based on a U.S. study only, should be checked in international reference populations [18]. For descriptive purposes the current CHQ summary scores incorporating child as well as parent/family effects can be defended, but if CHQ summary scores are intended for evaluations of medical decisions, the breakdown in \"child components\" and \"parent/ family components\" seems mandatory. In this population considerable ceiling effects were present, notably on the \"Physical functioning\" and \"Role functioning\" scales. This phenomenon is inevitable-in the HUI it is equally apparent-but limits, however, the use of these instruments to detect changes in a generally healthy population, or to describe excellent health beyond the average. The psychosocial scales produced less skewed data, as expected [8,9,11,13]. In specific clinical populations (asthma and ADHD in Table 2, as well as in other published studies), CHQ scale scores were lower only in those specific domains that can be expected to be affected by the specific condition. This finding can be interpreted as support for the validity of the CHQ [6,15,23]. Our study, to our knowledge for the first time, evaluated test-retest reliability of the CHQ. At group level, average scale scores were similar on two occasions, but only 8 of 14 of the scales/summary measures showed test-retest ICCs above .50. The rather small sample size of the retest, and, in particular, the obvious ceiling effects in some scales go a long way toward explaining this finding. The moderate testretest performance of \"Bodily pain\" (ICC ϭ .40) may in part be attributable to additional factors, as is also the case in its adult counterpart in the SF-36 [24]. Here, \"real\" variation may be indistinguishable from measurement error. The present study did not assess \"responsiveness to change\" of the CHQ, which would require a repeated-measures design in more varied samples [25]. Future studies should cover  this issue, preferably after reconfirmation of conventional retest characteristics. Direct comparison of the CHQ scales with relevant single HUI2 domains or the multiattribute utility value supported the validity for the large majority of scales. Higher correspondence in this population should not be expected, as content and structure of both instruments show distinct differences. Similar tests in defined patient groups should determine whether validity can be reproduced for the full range of scale scores. The CHQ scale \"General health perceptions\"-although showing the lowest Cronbach's alpha and evoking many comments from respondents-and the \"Physical summary measure\" in particular discriminated very well between groups with and without parent-reported chronic conditions. The CHQ was at least equal to the HUI2 in this respect. Medical consumption is a difficult external anchor in this regard, as factors other than health status may also determine utilization. This explains why, in this study, the presence/absence of chronic conditions was better able to be discriminated than high/low medical consumption by health status measures (both CHQ and HUI2). The further establishment of validity of the CHQ will require a similar field study among defined patient groups. The application of the CHQ in younger age groups (below 4 years of age) requires adaptation rather than leaving out non-relevant items. The CHQ-Toddler Form (2 months-4 years of age) is currently being developed [12]. From about 10 years of age, the self-report CHQ-Child Formfoot_2 is indicated, whenever possible combined with the Parent Form [6,26,27]. Another relevant issue is the use of the CHQ outside the country of origin. Procedures for translation, adaptation and subsequent validation of instruments such as the HUI, the SF36 and the CHQ are available and indeed have been applied in this and other studies [11,12,16,17]. The coverage of the CHQ is currently being expanded to 21 languages in 32 countries, which will facilitate international projects [28]. Our application in the Netherlands yielded no socio-cultural difficulties. Both CHQ and HUI2 may be regarded as suitable generic health status measures. Depending on the study objectives either of the two may be chosen, or where possible, the complementary use of both may be opted for. The HUI2, as a classification system is less detailed than the CHQ, focuses on functional/clinical aspects of health, but can be used for economic evaluation [7]. Moreover the HUI2 can be applied in pediatric as well as adult populations, whereas the CHQ should be complemented by the SF-36 for the adult component of study populations. On the other hand, the CHQ provides a feasible and detailed child health profile balanced for physical and psychosocial aspects of health and impact of ill health on family life. The CHQ has as specific advantage its availability in many languages and similarity to the scale structure of the SF-36. Before reaching a final judgement, additional studies are needed to assess test-retest stability as well as the responsiveness of the CHQ to change in varied samples. From this study and the presented data from other (clinical) studies, we conclude, at this stage, that psychometric properties of CHQ-based health status assessment satisfy the requirements for application in clinical as well as public health outcome research, in addition to disease-specific health status measures and clinical measures. a Reproduced with permission[6]. b,c ϭ % of respondents with worst/best possible score (ceiling/floor). d ϭ median e a Reproduced with permission[6] a Reproduced with permission a Test for differences between the average scale scores at the test and at the retest: two-sided Mann-Whitney U test. b bHUI2-singleattribute utilities are applied, as well as the HUI2-multiattribute utility based on the Canadian utility formula's[7]. c Physical and Psychosocial CHQ summary measures are based on a factor-analytical model on U.S. population samples[6]. bHUI2-singleattribute utilities are applied, as well as the HUI2-multiattribute utility based on the Canadian utility formula's[7]. c Physical and Psychosocial CHQ summary measures are based on a factor-analytical model on U.S. population samples[6] bHUI2-singleattribute utilities are applied, as well as the HUI2-multiattribute utility based on the Canadian utility formula's[7]. c Physical and Psychosocial CHQ summary measures are based on a factor-analytical model on U.S. population samples bHUI2-singleattribute utilities are applied, as well as the HUI2-multiattribute utility based on the Canadian utility formula's[7] bHUI2-singleattribute utilities are applied, as well as the HUI2-multiattribute utility based on the Canadian utility formula's b a One-sided Mann-Whitney U-test as it is hypothesised that mean values are lower in groups with conditions/physician visits. na ϭ not applicable, as mean (b) у mean (a). b Interpretation: d ϭ .2: small effect; d ϭ .5: medium effect; d ϭ .8 large effect[21]. a One-sided Mann-Whitney U-test as it is hypothesised that mean values are lower in groups with conditions/physician visits. na ϭ not applicable, as mean (b) у mean (a). b Interpretation: d ϭ .2: small effect; d ϭ .5: medium effect; d ϭ .8 large effect[21] a One-sided Mann-Whitney U-test as it is hypothesised that mean values are lower in groups with conditions/physician visits. na ϭ not applicable, as mean (b) у mean (a). b Interpretation: d ϭ .2: small effect; d ϭ .5: medium effect; d ϭ .8 large effect Three independent forward translations were discussed in a consensus meeting with the translators, researchers and CHQ developer in order to decide on a single Dutch version. After double backward translation, the CHQ developer agreed upon the final Dutch version. In this study the fulllength 94-item CHQ-PF was fielded, from which the CHQ-PF50 items were taken for analysis. The means of separate role-emotional and rolebehavior items, as well as the means of two general-behavior items were used as an approximation of rewording in the standardized CHQ-PF50[6]. The \"Change-in-health\" item was not fielded in this study. A seventh optional domain of HUI2 is \"Fertility,\" for specific purposes such as evaluation of juvenile cancer therapies. Complementary to the HUI2 a HUI3 exists with eight domains with five to six levels each[15]. The CHQ-CF has been assessed in a project parallel to the current study (manuscript in preparation).",
  "filePath": "C:\\Users\\Alex Isaev\\Documents\\truth source\\citation-verifier\\src\\document-database\\documents\\reliability_and_validity_of_comprehensive_health_status_measures_in_children_the.json",
  "sourcePdf": "C:\\Users\\Alex Isaev\\Documents\\truth source\\citation-verifier\\src\\document-database\\pdf-documents\\1-s2.0-S0895435601004115-main.pdf",
  "doi": "DC36DE01F3E5E6D10886F40D7B9588ED",
  "year": "",
  "journal": ""
}